name: hijacking_text_file_associations
description: |
  Detects registry modification events that change .txt files default handler to potentially establish persistence.
  Ref: https://hunt.io/blog/tinyloader-malware-cryptocurrency-theft-infrastructure
author: VaasudevKala
tactics:
- Persistence
techniques:
  - T1112
query: |
  DeviceRegistryEvents
  | where ActionType =="RegistryValueSet"
  | where ((RegistryKey has_any (@"\txtfile\shell\open\command",@"\FileExts\.txt\UserChoice") or RegistryKey endswith @"\.txt"))
  | where RegistryValueData !has "notepad.exe" // add notepad++.exe if used within the organisation