name: Sha1-Hulud Detection
description: |
  This rule detects 3 types of suspicious activities: first, the presence of files matching a list of known malicious SHA256 hashes associated with Sha1-Hulud; second, suspicious process behavior involving file deletion commands and third traffic towards potential C2.
  Ref: https://securitylabs.datadoghq.com/articles/shai-hulud-2.0-npm-worm/
author: VaasudevKala
tactics:
- Impact
- Exfiltration
techniques:
  - T1485  # Data Destruction
  - T1567 # Exfiltration Over Web Service
query: |
  let IOC_hashes=pack_array("62ee164b9b306250c1172583f138c9614139264f889fa99614903c12755468d0","f099c5d9ec417d4445a0328ac0ada9cde79fc37410914103ae9c609cbc0ee068","cbb9bc5a8496243e02f3cc080efbe3e4a1430ba0671f2e43a202bf45b05479cd","a3894003ad1d293ba96d77881ccd2071446dc3f65f434669b49b3da92421901a");
  let q1=DeviceFileEvents| where SHA256 in (IOC_hashes)|extend comment="File IOC detected";//file hash based
  let q2=DeviceProcessEvents //process behaviour based
  | where (InitiatingProcessFileName has_any ("setup_bun.js","bun_environment.js")) or (InitiatingProcessSHA256 in (IOC_hashes)) or (InitiatingProcessParentFileName has_any ("setup_bun.js","bun_environment.js"))
  | where (ProcessCommandLine has_all ("del","do","for")) or (ProcessCommandLine has_all ("shred","-delete","-empty"))
  |extend comment="Suspicious behaviour detected";
  let q3=DeviceNetworkEvents
  | where RemoteUrl has "bun.sh" // network event based
  | where InitiatingProcessCommandLine has "setup_bun.js"
  |extend comment="Sucpicious traffic detected";
  union q1,q2,q3